package com.company.lesson.task;

/**
 * Created by Home on 21.12.2016.
 */
public class TaskTwo {
    public static void main(String[] args) {
        /* Напишите программу, выводящую следующую таблицу:
        1990 135
        1991 7290
        1992 11300
        1993 16200
        В программе использовать только один оператор с System.out.print() или System.out.println(). */

        System.out.println("1990 135" + "\n" + "1991 7290" + "\n" + "1992 11300" + "\n" + "1993 16200");
    }
}
