package com.company.lesson.task;

/**
 * Created by Home on 21.12.2016.
 */
public class TaskFor {
    public static void main(String[] args) {
        /*Напишите программу, выводящую на экран ваше любимое стихотворение.
Для разбиения на строчки используйте подходящую управляющую последовательность.*/

        System.out.println("У лукоморья дуб зелёный" + "\n"+"Золотая цепь на дубе том"+"\n"+"И днем и ночью кот ученный"+"\n"+"Все ходит по цепи кругом");
    }
}
