package com.company.lesson.task;

/**
 * Created by Home on 21.12.2016.
 */
public class TaskTen {
    public static void main(String[] args) {
        /* Напишите программу, выполняющую действия, обратные тем, которые описаны в упражнении 10, то
 есть запрашивающую у пользователя сумму, указанную в десятичных фунтах, и переводящую ее в старую
 систему фунтов, шиллингов и пенсов. Пример взаимодействия программы с пользователем может выглядеть так:
  Введите число десятичных фунтов: 3.51 Эквивалентная сумма в старой форме записи: £3.10.2 Обратите внимание
   на то, что если вам придется присваивать вещественное значение (например, 12.34) переменной целого типа,
   то его дробная часть (0.34) будет потеряна, а целая переменная получит значение 12.
    Чтобы избежать предупреждения со стороны компилятора, используйте явное преобразование типов.
     Можно использовать операторы, подобные приведенным ниже: float decpounds;
     // сумма в десятичных фунтах int pounds; // сумма в старых фунтах float decfrac;
     // десятичная дробная часть pounds = static_cast(decpounds);
     // отбрасывание // дробной части decfrac = decpounds - pounds; // прибавление дробной части
      чтобы получить число шиллингов, следует умножить на 20 значение переменной decfrac.
       Аналогичным образом можно получить число пенсов.*/
    }
}
