package com.company.lesson.task;

/**
 * Created by Home on 21.12.2016.
 */
public class TaskThree {
    public static void main(String[] args) {
        /*Напишите программу, генерирующую следующий вывод: 10 20 19
Используйте представление числа 10 в виде целой константы. Для вывода числа 20 воспользуйтесь
 одной из арифметических операций с присваиванием, а для вывода числа 19 — операцией декремента. */

        int a = 5;
        int b = 15;
        System.out.println("10 " + (a + b) + " 19");
    }
}
