package com.company.lesson_2.task_2;

/**
 * Created by Home on 13.01.2017.
 */
public class TaskNine {
    public static void main(String[] args) {
        /* Модифицируйте программу, описанную в упражнении 6, так, чтобы вме-
       сто вычисления текущей суммы на вашем счете она вычисляла, сколько
       лет потребуется для того, чтобы при заданной процентной ставке и вели-
       чине начального вклада сумма на вашем счете достигла запрашиваемого
       вами значения. Для хранения найденного числа лет используйте перемен-
       ную целого типа (можно отбросить дробную часть значения, полученного
       в результате расчета). Самостоятельно выберите тип цикла, подходящий
       для решения задачи. */

    }
}
