package com.company.lesson_2.task_2;

/**
 * Created by Home on 13.01.2017.
 */
public class TaskSeven {
    public static void main(String[] args) {
        /* Напишите программу, которая циклически будет запрашивать ввод поль-
       зователем двух денежных сумм, выраженных в фунтах, шиллингах и пен-
       сах (см. упражнения 10 и 12 главы 2). Программа должна складывать
       введенные суммы и выводить на экран результат, также выраженный в
       фунтах, шиллингах и пенсах. После каждой итерации программа должна
       спрашивать пользователя, желает ли он продолжать работу программы.
       При этом рекомендуется использовать цикл do. Естественной формой
       взаимодействия программы с пользователем была бы следующая:
       Введите первую сумму £5 10 6
       Введите первую сумму £3 2 6
       Всего £8 13 0
       Продолжить(y/n) ?
       Для того чтобы сложить две суммы, вам необходимо учесть заем одного
       шиллинга в том случае, если число пенсов окажется больше 11, и одного
       фунта, если число шиллингов окажется больше 19. */
    }
}
