package com.company.lesson_2.task_2;

/**
 * Created by Home on 13.01.2017.
 */
public class TaskEight {
    public static void main(String[] args) {
        /* Представьте, что вы собираетесь пригласить к себе шестерых гостей, но за
       вашим столом могут разместиться всего лишь 4 человека Сколькими
       способами можно разместить четырех из шести гостей за обеденным сто-
       лом? Каждый из шести гостей может разместиться на первом стуле. Каж-
       дый из оставшихся пяти гостей может занять второй стул. На третьем
       стуле может разместиться один их четырех гостей, и на четвертом — один
       из трех оставшихся гостей. Двоим из гостей не достанется ни одного
       места. Таким образом, число возможных рассадок гостей за столом равно
       6*5*4*3 = 360. Напишите программу, которая будет производить аналогич-
       ные вычисления для любого числа гостей и любого числа мест за столом
       (при этом предполагается, что число гостей не меньше числа мест). Про-
       грамма не должна быть сложной, и вычисление можно организовать с по-
       мощью простого цикла for. */
    }
}
