package com.company.lesson_2.task_2;

/**
 * Created by Home on 13.01.2017.
 */
public class TaskTen {
    public static void main(String[] args) {
        /* Создайте калькулятор, выполняющий действия над денежными суммами,
       выраженными в фунтах, шиллингах и пенсах . Калькулятор должен складывать и вычитать вводимые значе-
       ния, а также производить умножение денежной суммы на вещественное
       число (операция умножения двух денежных сумм не имеет смысла, по-
       140 скольку квадратных денежных единиц не существует. Деление одной де-
       нежной суммы на другую мы тоже не будем рассматривать). Организация
       взаимодействия с калькулятором описана в упражнении 4 этой главы. */
    }
}
