package com.company.lesson_2.task_2;

/**
 * Created by Home on 13.01.2017.
 */
public class TaskThree {
    public static void main(String[] args) {
        /* Создайте эквивалент калькулятора, выполняющего четыре основных ариф-
       метических операции. Программа должна запрашивать ввод пользовате-
       лем первого операнда, знака операции и второго операнда. Для хранения
       операндов следует использовать переменные вещественного типа. Выбрать
       операцию можно при помощи оператора switch. В конце программа долж-
       на отображать результат на экране. Результат работы программы с поль-
       зователем может выглядеть следующим образом:
       Введите первый операнд, операцию и второй операнд: 10 / 3
       Результат равен 3.333333
       Выполнить еще одну операцию (y/n)? y
       Введите первый операнд, операцию и второй операнд: 12 + 100
       Результат равен 112
       Выполнить еще одну операцию (y/n)? n */

    }
}
