package com.company.lesson_2.task_2;

/**
 * Created by Home on 13.01.2017.
 */
public class TaskOne {
    public static void main(String[] args) {
        /* 1. Предположим, вы хотите создать таблицу умножения на заданное число.
       Напишите программу, которая позволяет пользователю ввести это число,
       а затем генерирует таблицу размером 20 строк на 10 столбцов. Первые
       строки результата работы программы должны выглядеть примерно сле-
       дующим образом:
       Введите число: 7
       7142128354249566370
       77849198105112119126133140
       147154161168175182189196203210 */



    }
}
