package com.company.lesson_2.task_2;

/**
 * Created by Home on 13.01.2017.
 */
public class TaskFor {
    public static void main(String[] args) {
        /* При помощи цикла for изобразите на экране пирамиду из символов 'X'.
       Верхняя часть пирамиды должна выглядеть следующим обазом:
       х
       ххх
       ххххх
       ххххххх
       ххххххххх
       Вся пирамида должна быть высотой не 5 линий, как изображено здесь,
       а 20 линий. Одним из способов ее построения может служить использова-
       ние двух вложенных циклов, из которых внутренний будет заниматься
       печатанием символов 'X' и пробелов, а другой осуществлять переход на
       одну строку вниз. */
    }
}
