package com.company.lesson_2.task_2;

/**
 * Created by Home on 13.01.2017.
 */
public class TaskEleven {
    public static void main(String[] args) {
        /* Создайте калькулятор, выполняющий четыре арифметических действия
       над дробями (см. упражнение 9 главы 2 и упражнение 4 этой главы).
       Формулы, демонстрирующие выполнение арифметических операций над
       дробями, приведены ниже.
       Сложение: a/b+c/d=(a*d+b*c)/(b*d)
       Вычитание: a/b-c/d=(a*d-b*c)/(b*d)
       Умножение: a/b*c/d=(a*c)/(b*d)
       Деление: a/b/c/d = (a*d)/(b*c)
       Пользователь должен сначала ввести первый операнд, затем знак опера-
       ции и второй операнд. После вычисления результата программа должна
       отобразить его на экране и запросить пользователя о его желании произ-
       вести еще одну операцию */
    }
}
